# SteelElemHoleBackTaperThread Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemHoleBackTaperThread Property
ParameterTypeId Class See Also
---
"Back taper thread"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemHoleBackTaperThread { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemHoleBackTaperThread As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemHoleBackTaperThread {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace